//
//  main.cpp
//  Pomagalo_1
//
//  Created by Pepi on 3/24/17.
//  Copyright © 2017 Pepi. All rights reserved.
//1. Да се намерят цифрите на  4 цифрено цяло число

#include <iostream>
using namespace  std ;
int main(){
    //1. Да се намерят цифрите на  4 цифрено цяло число
    ///////////////////////////////////////////////////
  /*  int num ;
    int thausants ;
    int hundr ;
    int tens ;
    int units ;
    
    cout <<  " enter ";
    
    cin >> num ;
    
    
    thausants = num / 1000 ;
    hundr = num / 100 % 10;
    tens = num / 10  % 10;
    units = num % 10 ;
    
    cout << thausants  <<  hundr << tens << units ;

*/
    
  //////////////////////////////////////////////////////
    ///////////////////////////////////////////////////
    // 3. Дадено е едно четирицифрено число. Да се генерира ново число, създадено то цифрите на първото подредени в обратен ред.
    
  /*
    int num1  ;
    int num2  ;
    int num3  ;
    int num4  ;
    int input  ;
    int reverse ;
    
    
    
    cout << "enter " ;
    
    cin >> input ;
    
    num1 = input / 1000 ;
    num2 = input / 100 % 10 ;
    num3 = input / 10  % 10 ;
    num4 = input % 10;
    
   //  cout<< num1 << num2 << num3 << num4 ;
    
    reverse = (num4 * 1000) + (num3 * 100 ) + (num2 * 10) + num1 ;
    
    cout << reverse << endl;
    
   */
    
    
    ///////////////////////////////////////////////////////////////////////////
    //////////////////////////////////////////////////////////////////////////
   // 4. Даден е интервал [N,M] . Да се намери броя на числата в интервала, които се делят на 5.
    
    
  /*  int num1 ;
    int num2 ;
    int count ;
    
    cout << "enter 1  : " << endl;
    
    cin >> num1;
    
    cout << "enter 2  : " << endl;
    
    cin >> num2 ;
    
    
    for (int i  = num1 ; i <= num2; i++) {
        
        if (i  % 5   == 0) {             // s tozi if se razbira dali chisloto se deli na 5 //
                                          //////////////////////////////////////////////////
            count ++ ;
            
           cout << count;
            
        }
      
    }
    */
    
      ///////////////////////////////////////////////////////////////////////////////////////
    //////////////////////////////////////////////////////////////////////////////////////////
    
 //   5. Изведете сумата на цифрите на всички трицифрени числа.
 //   Пояснение:
//На всяко да се намерят цифрите и се търси общата им сума (не на всяко число на цифрите сумата , а на всички цисла всички цифри)
 //   Числата са 100 , 101, 102, 103, 104, .... 998, 999. и това означава да се съберат: 1 + 0 + 0 + 1  + 0 + 1 + 1 + 0 + 2 + 1 + 0 + 3 + .... + 9 + 9 + 8 + 9 + 9 + 9
    
    
   /* int begin = 100 ;
    int end = 102 ;
    int hundr ;
    int tens ;
    int units ;
    int count ;
    long total ;
    
    
    for(int i = begin ; i <= end ; i++){
        
        hundr = i / 100 ;
        
        
        tens = i /10 % 10 ;
        
        units = i % 10 ;
    
        
        count = units + tens + hundr ;
        
        total += count ;
        
          // cout << total<< endl ;
    }
      cout << total<< endl ;
 
 */
    
    ////////////////////////////////////////////////////////////////////////////////
    //////////////////////////////////////////////////////////////////////////////
    
  //  1. Write a program that prints all the numbers from 1 to n
    
  /*  int begin = 1 ;
    int end ;
    
    cin >> end ;
    
    for (int i = begin; i <= end ; i++) {
        cout << i ;
    }
    
   */
    
    
    //////////////////////////////////////////////////////////////////////////////////////
    /////////////////////////////////////////////////////////////////////////////////////
    
   // . Write a program that prints all the numbers from 1 to
 //   N, that are not divisible by 3 and 7.
    
    
   /* int begin = 1 ;
    int end ;
    cin >> end ;
    
    for (int i = 1 ; i <= end; i++) {
        
        if(i % 21 )         // ako chisloto trqbva da se deli na dve chisla
                           //te se umnojavat i se deli s tehnata stoinos na procent
            cout <<i ;
    }
    
    
*/
    //////////////////////////////////////////////////////////////////////////////////////////
    //////////////////////////////////////////////////////////////////////////////////////////
    
 //   Variable price holds the price of 1 kg bonbons.
 //   Calculate the price of 1, 2, …, 10 kg bonbons.
    
    
  /*
    int price ;
    int nPrice ;
    
    cin >> price ;
    
    for (int i = price; i <= 10; i++) {
        
        nPrice = i * price ;
        
        cout << nPrice << endl ;
    }
    
    
  */
    ////////////////////////////////////////////////////////////////////////////////////////
    ///////////////////////////////////////////////////////////////////////////////////////
    //Write a program that calculates the product of all
   // numbers from 1 to N.
    
    
    
  /*
    long begin = 1 ;
    long end  ;
    long product  = 1 ;
   
    
   cin >> end  ;
    
    for (long i = begin; i <= end; i++) {
        
        product = i * product; //  mnogo e vajno da ne zabbravq da umoja ( i po produkt ) inache ne stava
        
     }
     cout << product << endl;
    

 */
    
    
    ////////////////////////////////////////////////////////////////////////////////////
    ///////////////////////////////////////////////////////////////////////////////////
    
 //   Write a program that calculates the power of 2 of  // cikyl prez edno
 //   every number from 1 to N.   // power e na wtora stepen
    
    

    
 /*
    
    int begin = 1 ;
    int end ;
    long power ;
    
    cin >> end ;
    
    for (int i = begin; i <= end; i +=2) {
        power = i*i;
        
    
        cout << power++ << endl;
    }
    
    
    
*/
    
    //////////////////////////////////////////////////////////////////////////////////////////
    ////////////////////////////////////////////////////////////////////////////////////////
    //
    //7. Напишете програма, която намира всички трицифрени числа, за които сумата от цифрите му е 15.
    

    
   /* int num ;
    int hundr ;
    int tens ;
    int units ;
    
    cin >> num ;
    
    hundr = num / 100;
    tens = num / 10 % 10;
    units = num % 10 ;
    
   // cout << hundr ;
    
    
    if (hundr + tens + units == 15) {
        cout << " the sum is 15 " << endl;
        
    }
    else {
        cout << " the sum not 15 "<<endl;
    }
    
   */
    
    //////////////////////////////////////////////////////////////////////////////////////
    /////////////////////////////////////////////////////////////////////////////////////
    //Напишете програма, която намира -цифри на chisoto ;
                          /// vajno///
  /*
    int num ;
    
    cin >> num  ;
    
    
    
    do {
        int digit = num % 10 ;        ///     vajno tozi cikyl namira chislata
                                     // na chislo ne zavisimo ot goleminata i gi obryshta

        cout <<"digit"<<digit<<endl;
        num = num/10;
       
    } while (num>0);
   
    */
    
    
    ////////////////////////////////////////////////////////////////////////////////////////////
    ///////////////////////////////////////////////////////////////////////////////////////////
    //1. Дадени са цели числа K и N (N > 0). Изведете N пъти числото К.
    
    
   /* int  n ;
    int  k ;
    
    cin >> n ;
    
    cin >> k ;
    
    
    for (int i  = 0 ; i  <= n ; i++) {
      
        cout << k<<   endl;
    }
    
    */
    
    //////////////////////////////////////////////////////////////////////////////////////////////
    /////////////////////////////////////////////////////////////////////////////////////////////
    // Дадени са две цели числа A и B (A < B). Изведете във възходящ ред всички цели числа,
    //разположени между A и B (вкючително самите числа A и B), а после и количеството N на
    //тези числа.
    
   /* int a ;
    int b ;
    long n ;
    cin >> a;
    cin >> b;
    
    if (a>b ) {
        cout << "enter anoder number" ;
    }
    else{
    
    for (int i = a ; i <= b; i++) {
  
        cout <<"digit"<<i<<endl;
        
        n = i++;
        
        cout << "Kolichestvoto "<< n << endl;
    }
    }
*/
   
    
 ///////////////////////////////////////////////////////////////////////////////////////////////
    ///////////////////////////////////////////////////////////////////////////////////////
    //5. Дадено е естествено число – цена за 1 кг бонбони. Изведете цената на 0.1, 0.2, …, 1 кг
   // бонбони.
    
    
    
   /*
    float price ;
    float nPrice ;
    
    cin >> price ;
    
    for (int i = 1; i <= 10; i++) {
        
        nPrice = i * price ;
        
        cout << nPrice / 10  << endl;
    
    
    }
    
  */
    
    //////////////////////////////////////////////////////////////////////////////////////////
    //////////////////////////////////////////////////////////////////////////////////////////
   // 7. Дадени са две цели числа A и B (A < B). Намерете сумата на всички цели числа от А до В
  //  включително.
  
 /*
    int a ;
    int b ;
    long c = 0 ;
    
    cin >> a ;
    cin >> b ;
    
    for (int i = a ; i <=b; i++) {
        c = i + c;
        
        cout << c << endl;
    }
    
   */
    
/////////////////////////////////////////////////////////////////////////////////////////////////////
    ////////////////////////////////////////////////////////////////////////////////////////////////
   // 15. Дадени са цели положителни числа А и В (А < В). Изведете всички цели числа между А
 //   и В включително като всяко число трябва да се изведе толкова пъти колкото е стойността
 //   му.
    
    
   ////////////////////////////////////////////////////////////////////////////////////////////
    ////////////////////////////////////////////////////////////////////////////////////////////
   // 1. Write an if statement that examines two integer variables and exchanges their values if the first one is greater than the second one.

    
  /*
    int a ;
    int b ;
    cin >> a;
    cin >> b ;
    
    if (a > b) {
        cout<< b << a <<endl;
    }
    else{
        cout <<a << b ;
    }
    
 */
    
    ////////////////////////////////////////////////////////////////////////////////////////////
    ///////////////////////////////////////////////////////////////////////////////////////////
   // Напишете програма, която показва знака (+ или -) от произведението на три реални числа, без да го //
    //изчисляване. Използвайте последователност на if
    
 /*
    int a ;
    int b ;
    int c ;
    
    
    cin >> a ;
    cin >> b ;
    cin >> c ;
    
    
    if (a>0 && b>0  && c > 0 ) { // trqbva da se dorazpishe zadachata za vsichki varianti
                                 ///   inache raboti s oshte nqkolko if-a
        cout<< "+" <<endl ;
    }
    
        else{
        if (a>0 && b >0 &&  c <0) {
           cout<< "-" ;
            
       }
    }
    if (a<0 && b < 0 && c >0 ) {
        cout<< "+";
    }
    
    
  */
    
    ///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
    //3. Напишете програма, която намира най-големият от трите числа, използвайки вложени if
   /*
    int a ;
    int b ;
    int c ;
    
    cin>>a;
    cin>>b;
    cin>>c;
    
    
    
    if (a > b && a > c  ) {
        cout<<a;
    }
    else{
        if (b > a && b > c) {
            cout<< b ;
            
        }
    
    }
    if (c > a && c > b ) {
        cout << c;
    }
    
   */
    
    ///////////////////////////////////////////////////////////////////////////////////
    ///////////////////////////////////////////////////////////////////////////////////
    //Напишете програма, която сортира 3 реалните стойности в низходящ ред, използвайки вложени if
 
    /*
    int a ;
    int b ;
    int c ;
    
    cin >> a ;
    cin >> b ;
    cin >> c ;
    
    if (a > b  ) {
       
        if (a > c ){
            
            if(b> c ){
                cout<< c << b << a ;
            
            }
                                          // samo trqbva da se dorazpishat if-ovete  za sledvashtiq sluchai
        }
        
   
    }if (b>c) {
        if (b>a) {
            if (c>a) {
                cout << a << c << b;
            }
        }
    }
    
  
  */
    
    /////////////////////////////////////////////////////////////////////////////////////////
    ////////////////////////////////////////////////////////////////////////////////////////
    
    
   // 22. Началния влог в банка е равен на 100 лева. След всеки месец размера на влога се
  //  увеличава с Р процента от съществуващата сума(Р-реално число, 0 < P< 25). По данните за
 //   Р определете след колко месеца размера на влога ще надвиши 1100 лева, и иведете
 //   намереното количество месеци К(цяло число) и крайния размер на влога S(цяло число).
/*
    float begin = 100;
    float procent ;
    
    
    
    cout<< " enter procent " ;
    
    cin >> procent;
    
    if (0 >= procent || procent >= 25) {
        cout<<"enter new number 0 < procent < 25  ";
        cin >>procent;
    }
    
    
    for (int i = 1; i < 1000 ; i++) {
        float sum = procent * begin / 100;   //  formula za izchislqvane na procent
        
        begin = begin + sum ;
        cout << "each month $ :  "<<begin<< endl;
        
        if (begin > 1100) {
            cout << "month:"<<i << endl;break;
        }
    }
*/
    
    
    
    /////////////////////////////////////////////////////////////////////////////////////////////////
    /////////////////////////////////////////////////////////////////////////////////////////////////
    ////1. Дадени са цели числа K и N (N > 0). Изведете N пъти числото К.
    
  /*
    int k  ;
    int n ;
    
    
    
    cout << "entrer number 1 " ;
    
    cin >> n;
    
    cout << " enter  number 2  :" ;
    
    cin >> k ;
    
    
    if (n < 0 ) {
        cout << "enter anoder numbrt " ;
    }
    else  {
        
        for (int i = 0 ; i < n ; i++) {
            
            cout << k ;
            
        }
        
    }
*/
    ///////////////////////////////////////////////////////////////////////////////////////////
    //////////////////////////////////////////////////////////////////////////////////////////
   // 23. Скиор започнал тренировки, пробягал първия ден 10 км. Всеки следващ ден той
   // увеличавал пробега с Р процента от пробера на предишния ден(Р-естествено число, 0 < P<
  //                                                              50). По данни Р се опредете, след колко дни сумарния пробег на скиора за всички дни ше
 //   стане 200 км, и изведете намереното количество дни К(цяло) и сумарния пробег S(реално
  //  число).
    
 /*
    int begin = 10 ;
    int procent ;
    
    cout<< "enter procent ";
    cin >> procent;
    
    for (int i = 1; i <= 150; i++) {
        
        int sum = procent * begin  / 100;
        begin = begin + sum ;
        cout << "each day :"<< begin << endl;
        if (begin >= 200) {
            cout<< i << endl;break;
        }
        
    }
    
   */
    
    //////////////////////////////////////////////////////////////////////////////////////////
    /////////////////////////////////////////////////////////////////////////////////////////
   // switch case
    
    
    /* int day ;
     int week = 7 ;
     cout << " enter    " << endl;
     
     cin >> day;
     switch (day){
     case  1 : cout << week      << endl ; break; // v case moje da
     case  2 : cout << " Tuesday"      << endl ; break;
     case  3 : cout << " Wednesday"    << endl ; break;
     case  4 : cout << " Thursday"     << endl ; break;
     case  5 : cout << " Fraiday"      << endl ; break;
     case  6 : cout << " saturday"     << endl ; break;
     case  7 : cout << " Sunday"       << endl ; break;
     default : cout << " Invalid day " << endl ; break;
     
     }
     
     
     
     */

    
    /////////////////////////////////////////////////////////////////////////////////////////
    ///////////////////////////////////////////////////////////////////////////////////////
    //5. програма Напиши, че за дадена цифра (0-9) осчетоводи като отпечатва името на тази цифра (на български език). Използвайте изявление ключ.
  //
    
  /*
    int num ;
    
    cin >> num;
    
    switch (num) {
        case 1 :cout << "edno"<<endl;break;
        case 2 :cout << "dve"<<endl;break;
        case 3 :cout << "tri"<<endl ;break;
            
            
            
            break;
            
        default:cout<<"enter wrong number "<<endl;break;
            break;
    }
    
   */
    /////////////////////////////////////////////////////////////////////////////////////////
    /////////////////////////////////////////////////////////////////////////////////////////
  //  7. Да се напише програма, която намира най-голямата от 5 дадени числа.
    
  /*
    int a ;
    int b ;
    int c ;
    int d ;
    int f ;
    
  
    cin >> a ;
    cin >> b ;
    cin >> c ;
    cin >> d ;
    cin >> f ;
                                             // trqbva da se dorazpishat if-ovete
    
    if (a>b && a>c && a>d && a>f) {
        cout<<" a is biggest number" <<endl;
    }
    else{
        if (b>a &&  b>c && b>d && b>f) {
            cout << "b is biggest number "<<endl;        }
    }
    
    if (c>a && c>b && c>d && c>f) {
        cout<<"c is the biggest number " << endl ;
    }
    

   */
    
    
    /////////////////////////////////////////////////////////////////////////////////////
    ////////////////////////////////////////////////////////////////////////////////////
    //Ние са дадени 3 цели числа. Напишете програма, която проверява дали сумата от някои подмножество от тях е равен на 0.
    //Предвид -2, -1, 1, сумата от 1 и -1 е 0. предвид, 3, 1, -7, не съществува подклас с сума 0.
    
  /*
    
    int a ;
    int b ;
    int c ;
    
    
    cin >> a ;
    cin >> b ;
    cin >> c ;
    
    if (a+b ==0) {
        cout<<"the sum  from a i b is 0 " << endl;
    }
    else{
        
        if (a + c == 0) {
            cout<<" the sum a i c  is 0 "<<endl;
        }
    }
    if (b+c ==0 ) {
        cout<<"the sum  b i c = 0 " <<endl;
  
    
    }
        
  */
    ////////////////////////////////////////////////////////////////////////////////////////////
    ////////////////////////////////////////////////////////////////////////////////////////////
    // swithc case
  /*
    int primeNumber ;
    cin >> primeNumber;
    
    switch (primeNumber) {
        case 1 :
        case 4 :
        case 6 :
        case 8 :
        case 9 :
        case 10: cout << "the number is not Prime " ; break;
        case 2 :
        case 3 :
        case 5 :
        case 7 :cout <<" The number is prime " ; break ;
            
            
        default:cout << " I Dont know this number  " << endl ; break ;
            
    }
  
    
    
    
    */
    //////////////////////////////////////////////////////////////////////////////////////////
    /////////////////////////////////////////////////////////////////////////////////////////
    //9. Напишете програма, която прилага бонус точки към дадени точки в интервала [1..9] чрез прилагане на следните правила: Ако резултатът е между 1 и 3, програмата го умножава по 10; ко тя е между 4 и 6, тя умножава по 100; ако тя е между 7 и 9, тя умножава по 1000. Ако е нула или по-голямо от 9, програмата трябва да докладва за грешка. Използвайте изявление ключ и в края отпечатате изчислява нова оценка в конзолата.
 //
  /*
    int result ;
    cin >> result ;
    
    if (result >= 1 && result <= 3 ) {
        cout<< result*10<< endl;
    }
    else{
        if(result >= 4 && result <=6){
            cout<< result*100<<endl;
        }
        else{
            if (result >=7 && result <=9) {
                cout<< result * 1000<<endl;
            }
        }
        if ((result = 0 || result > 9)) {
            cout << "something wrong" <<endl;
        }
        
    }
    
    
   */
    
    
    //////////////////////////////////////////////////////////////////////////////////////////////
    /////////////////////////////////////////////////////////////////////////////////////////////
  //  19. Дадено е цяло число N(> 0). Ако едно то се явява степен на числото 3, изведете True,
  //  ако ли не – изведете False.
    
    
    int x = 3;
   // int temp = x;
    while (x ) {
        if(x % 5 != 0){
            cout<< "false";break;
        }
        else{
            x=x/5;
            if (x==1) {
                cout<<"true";break;
            }
        
        }
        
    }
    
    
    return 0;
}
